Public Member Functions | Friends | List of all members
ACAPI::MEP::FlexibleSegmentUIManager Class Referencefinal
MEP Element Manager
The FlexibleSegmentUIManager contains UI-related services for a FlexibleSegment. More...
#include <MEPFlexibleSegmentUIManager.hpp>
 Inheritance diagram for ACAPI::MEP::FlexibleSegmentUIManager:
 Public Member Functions
Result< FlexibleSegmentDefault >  | CreateFlexibleSegmentDefaultFromToolUIData (const TBUI::IAPIToolUIData &toolUIData)
Creates a FlexibleSegmentDefault from a toolUIData.
Result< void >  | ApplyFlexibleSegmentDefaultToToolUIData (TBUI::IAPIToolUIData &toolUIData, const FlexibleSegmentDefault &flexibleSegmentDefault)
Changes the default elem in the given toolUIData.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
Result< FlexibleSegmentUIManager >  | CreateFlexibleSegmentUIManager ()
Creates a FlexibleSegmentUIManager.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The FlexibleSegmentUIManager contains UI-related services for a FlexibleSegment.
Since
Archicad 28
Member Function Documentation
◆ ApplyFlexibleSegmentDefaultToToolUIData()
 Result< void > ACAPI::MEP::FlexibleSegmentUIManager::ApplyFlexibleSegmentDefaultToToolUIData  |  ( |  TBUI::IAPIToolUIData & |  toolUIData,
|  const FlexibleSegmentDefault & |  flexibleSegmentDefault )
Changes the default elem in the given toolUIData.
Parameters
toolUIData | The data in which the default elem will be changed
flexibleSegmentDefault | The default to be set
Returns
Returns error if the FlexibleSegmentDefault is not the same type as the Default in IAPIToolUIData, or if they mismatch in their MEP Domain, otherwise nothing.
◆ CreateFlexibleSegmentDefaultFromToolUIData()
 Result< FlexibleSegmentDefault > ACAPI::MEP::FlexibleSegmentUIManager::CreateFlexibleSegmentDefaultFromToolUIData  |  ( |  const TBUI::IAPIToolUIData & |  toolUIData | )
Creates a FlexibleSegmentDefault from a toolUIData.
Parameters
toolUIData | The data which contains the temporary state of the FlexibleSegment in the scope of a Settings Dialog.
Returns
Returns error if the given Default from the IAPIToolUIData is not an FlexibleSegmentDefault, otherwise returns the FlexibleSegmentDefault created from it.
Friends And Related Symbol Documentation
◆ CreateFlexibleSegmentUIManager
 Result< FlexibleSegmentUIManager > CreateFlexibleSegmentUIManager  |  ( |   | )
friend
Creates a FlexibleSegmentUIManager.
Returns
If able, creates a new manager for FlexibleSegment, otherwise Error.